backend/app/controllers/api/v1/client/portal_controller.rb

        def request_magic_link
          contact = Contact.find_by!(email: params.require(:email).downcase)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."email" = $1 LIMIT $2  [["email", "aponcz@gmail.com"], ["LIMIT", 1]]

        def create_session
          payload = JwtService.decode(params.require(:magic_token))
          return render(json: { error: "wrong_token_type" }, status: :unauthorized) unless payload["type"] == "client_magic"

          contact = Contact.find(payload.fetch("contact_id"))
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", "33d93d1f-34de-4d16-9d5e-57dea4d264da"], ["LIMIT", 1]]

        def create_upload_url
          invite = find_accessible_invite_by_request_item(params[:id])
          item = invite.request_items.find(params[:id])
---
SELECT "request_items".* FROM "request_items" WHERE "request_items"."invite_id" = $1 AND "request_items"."id" = $2 LIMIT $3  [["invite_id", "ec8b7110-3ee7-4806-8cae-905f382b4f91"], ["id", "33f54feb-53b4-412c-8592-05c0041605a2"], ["LIMIT", 1]]

        def complete_upload
          invite = find_accessible_invite_by_request_item(params[:id])
          item = invite.request_items.find(params[:id])
          file = item.uploaded_files.create!(
            uploaded_by_contact: @current_contact,
            storage_key: params.require(:storage_key),
            filename: params.require(:filename),
            content_type: params.require(:content_type),
            byte_size: params[:byte_size]
          )
---
SELECT "request_items".* FROM "request_items" WHERE "request_items"."invite_id" = $1 AND "request_items"."id" = $2 LIMIT $3  [["invite_id", "f5c969ec-e37a-4a11-b94c-e9ba6522037b"], ["id", "7e986bf4-bbcf-4cae-bd34-e26e53d9eae0"], ["LIMIT", 1]]
INSERT INTO "uploaded_files" ("request_item_id", "uploaded_by_contact_id", "reviewed_by_id", "storage_key", "filename", "content_type", "byte_size", "status", "rejection_reason", "reviewed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

        def find_accessible_invite(public_token)
          # Support both old single-contact invites and new shared invites
          Invite.where(public_token: public_token)
            .where(
              'contact_id = :contact_id OR id IN (SELECT invite_id FROM invite_contacts WHERE contact_id = :contact_id OR LOWER(email) = :email)',
              contact_id: @current_contact.id,
              email: @current_contact.email.to_s.downcase
            )
            .first! || raise(ActiveRecord::RecordNotFound)
---
SELECT "invites".* FROM "invites" WHERE "invites"."contact_id" = $1 AND "invites"."public_token" = $2 LIMIT $3  [["contact_id", "33d93d1f-34de-4d16-9d5e-57dea4d264da"], ["public_token", "jEegKdzfzCIYeGp9wfZJ1ldAahkEgW_M8GSaR6xRLyE"], ["LIMIT", 1]]

        def find_accessible_invite_by_request_item(request_item_id)
          # Support both old single-contact and new shared invites for request items
          RequestItem.where(id: request_item_id)
            .joins(:invite)
            .where(
              'invites.contact_id = :contact_id OR invites.id IN (SELECT invite_id FROM invite_contacts WHERE contact_id = :contact_id OR LOWER(email) = :email)',
              contact_id: @current_contact.id,
              email: @current_contact.email.to_s.downcase
            )
            .first!&.invite || raise(ActiveRecord::RecordNotFound)
---
SELECT "invites".* FROM "invites" INNER JOIN "request_items" ON "request_items"."invite_id" = "invites"."id" WHERE "invites"."contact_id" = $1 AND "request_items"."id" = $2 ORDER BY "invites"."id" ASC LIMIT $3  [["contact_id", "fd2b0a85-9946-44c5-b6ab-1c2073e71730"], ["id", "7e986bf4-bbcf-4cae-bd34-e26e53d9eae0"], ["LIMIT", 1]]