backend/app/controllers/api/v1/auth_controller.rb

      def register
        org = Organization.create!(name: params.require(:organization_name))
        user = org.users.create!(
          name: params.require(:name),
          email: params.require(:email).downcase,
          password: params.require(:password),
          role: :admin
        )
---
INSERT INTO "organizations" ("name", "subdomain", "brand_color", "logo_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Acme Lending"], ["subdomain", nil], ["brand_color", nil], ["logo_url", nil], ["created_at", "2026-06-27 02:31:42.222295"], ["updated_at", "2026-06-27 02:31:42.222295"]]
INSERT INTO "users" ("organization_id", "name", "email", "password_digest", "role", "last_login_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def login
        user = User.find_by!(email: params.require(:email).downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@acme.test"], ["LIMIT", 1]]