backend/app/controllers/api/v1/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."organization_id" = $1 ORDER BY "contacts"."created_at" DESC  [["organization_id", "007c7028-445d-44ac-9363-beacd5c34d1c"]]
---
      def index
        render json: current_organization.contacts.order(created_at: :desc)

INSERT INTO "contacts" ("organization_id", "name", "email", "phone", "external_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      def create
        render json: current_organization.contacts.create!(contact_params), status: :created