backend/app/controllers/api/v1/invites_controller.rb

      def index
        render json: current_organization.invites.includes(:contact).order(created_at: :desc).as_json(include: :contact)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" IN ($1, $2)  [["id", "ac9c72ae-9aa3-4650-8ba6-e199b40af1e4"], ["id", "fd2b0a85-9946-44c5-b6ab-1c2073e71730"]]
SELECT "invites".* FROM "invites" WHERE "invites"."organization_id" = $1 ORDER BY "invites"."created_at" DESC  [["organization_id", "007c7028-445d-44ac-9363-beacd5c34d1c"]]

      def create
        contact = current_organization.contacts.find(params.require(:contact_id))
        invite = current_organization.invites.create!(invite_params.merge(contact: contact, created_by: current_user))
        Array(params[:request_items]).each do |item|
          invite.request_items.create!(item.permit(:title, :description, :kind, :due_at, :required))
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."organization_id" = $1 AND "contacts"."id" = $2 LIMIT $3  [["organization_id", "007c7028-445d-44ac-9363-beacd5c34d1c"], ["id", nil], ["LIMIT", 1]]
INSERT INTO "invites" ("organization_id", "contact_id", "created_by_id", "title", "message", "status", "public_token", "due_at", "brand_color", "logo_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "request_items".* FROM "request_items" WHERE "request_items"."invite_id" = $1  [["invite_id", "ec8b7110-3ee7-4806-8cae-905f382b4f91"]]
INSERT INTO "request_items" ("invite_id", "title", "description", "kind", "status", "required", "due_at", "form_schema", "form_response", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"