backend/app/controllers/api/v1/uploaded_files_controller.rb

      def approve
        uploaded_file.update!(status: :approved, reviewed_by: current_user, reviewed_at: Time.current)
---
UPDATE "uploaded_files" SET "status" = $1, "reviewed_at" = $2, "updated_at" = $3 WHERE "uploaded_files"."id" = $4  [["status", "approved"], ["reviewed_at", "2026-06-28 20:39:37.853769"], ["updated_at", "2026-06-28 20:39:37.854061"], ["id", "9f4ac9da-700c-454b-b472-5ded0cc5e282"]]

      def reject
        uploaded_file.update!(status: :rejected, reviewed_by: current_user, reviewed_at: Time.current, rejection_reason: params[:reason])
---
UPDATE "uploaded_files" SET "reviewed_by_id" = $1, "status" = $2, "rejection_reason" = $3, "reviewed_at" = $4, "updated_at" = $5 WHERE "uploaded_files"."id" = $6